Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བསམ་གཏན་ལ་གནས་ནས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་འཇུག་པ་དང་། འདོད་པ་ན་སྤྱོད་པའི་ཆོས་རྣམས་ལྷག་པར་མཐོང་ཡང་མི་སྤོང་ལ། སྐྱོན་དང་སྐྱོན་མེད་པ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་གཡེང་བ་མེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration free from distraction is the understanding of the perfection of insight while remaining in concentration. Although one clearly recognizes the phenomena of the desire realm, one does not relinquish them but correctly distinguishes between the presence and absence of flaws.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཀྱང་སྤྱོད་ཅིང་འཇིག་རྟེན་གྱི་ཆོས་ཐམས་ཅད་ཀྱང་སྤྱོད་ལ་སྐྱོན་དང་སྐྱོན་མེད་པ་ཡང་རྟོགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་ཀྱང་སྤྱོད་ལ་སྐྱོན་དང་སྐྱོན་མེད་པ་ཡང་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་གཡེང་བ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight free from distraction is to practice the six perfections while correctly distinguishing between the presence and absence of flaws in relation to all the phenomena of the world and the qualities of the bodhisattvas.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་གཡེང་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections free from distraction.

source: དེ་ལ་མི་འཁོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of not cycling in saṃsāra?

source: བྱང་ཆུབ་སེམས་དཔའ་དམིགས་པ་མེད་པ་ལ་གནས་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་མི་འཁོར་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity of not cycling in saṃsāra is the generosity of a bodhisattva who abides by nonapprehension.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལས་ཕྱིར་མི་ལྡོག་པ་གང་ཡིན་པ་དེ་ནི་མི་འཁོར་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline of not cycling in saṃsāra is to not regress from the qualities of hearers, solitary buddhas, and buddhas.

source: ངར་འཛིན་དང་། ང་ཡིར་འཛིན་པ་ཆད་ཅིང་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་ལས་དབེན་པ་གང་ཡིན་པ་དེ་ནི་མི་འཁོར་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience of not cycling in saṃsāra is to cut through grasping in terms of ‘I’ and ‘mine’ and to stay clear of attachment and anger.

source: དེ་སེམས་ཅན་གཞན་གྱི་ངོར་བལྟ་ཞིང་ཡེ་ཤེས་ལས་མི་ལྡོག་པ་ཕ་རོལ་གནོན་པ་གང་ཡིན་པ་དེ་ནི་མི་འཁོར་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence of not cycling in saṃsāra is to show concern for others, remain with wisdom, and subdue adversaries.

source: མཐོང་བ་དང་། ཐོས་པ་དང་། དྲན་པའི་ཆོས་རྣམས་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར་གནས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་མི་འཁོར་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration of not cycling in saṃsāra is to maintain concentration for the sake of fully understanding that which is seen, heard, and recollected.

source: ཐེ་ཙོམ་ཡང་དག་པར་བཅོམ་ཞིང་མཚན་མ་མེད་པས་རབ་ཏུ་ཕྱེ་ལ། བྱང་ཆུབ་ཏུ་ཕྱོགས་གཅིག་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཁྱད་པར་དུ་འཕགས་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་མི་འཁོར་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight of not cycling in saṃsāra is the superior insight that conquers all doubt and is distinguished by the absence of marks—the omniscient wisdom that is the single factor of awakening.

source: འདི་དག་ནི་མི་འཁོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of not cycling in saṃsāra.

source: ཇི་སྲིད་དུ་དམ་པའི་ཆོས་མ་ནུབ་ཀྱི་བར་དུ་རྣམ་པར་སྨིན་པ་སེམས་ཅན་དང་ལྷན་ཅིག་ཏུ་འཇུག་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་འཁོར་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity related to saṃsāra is the perfection of generosity that engages with sentient beings for as long as the sacred Dharma has not yet disappeared.

source: དགའ་ལྡན་གྱི་གནས་ན་གནས་པ་ནས་བཟུང་སྟེ། ནམ་མྱ་ངན་ལས་འདས་པའི་བར་དུ་རབ་ཏུ་འཇུག་པ་སྤང་བའི་ཕྱིར་གནས་པ་བཀྲ་ཤིས་པ་གང་ཡིན་པ་དེ་ནི་འཁོར་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline related to saṃsāra is auspicious abiding in order to relinquish all engagements, from the time of dwelling in the Heaven of Joy right up to nirvāṇa.

source: སྐྱེ་བོ་མང་པོ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་གནས་ཤིང་དུས་སུ་ཡོངས་སུ་བསྔོས་ལ། ཡང་དག་པ་དེ་ཁོ་ན་དང་ལྷན་ཅིག་པའི་བཟོད་པ་འཁོར་བ་དང་འཐུན་པ་གང་ཡིན་པ་དེ་ནི་འཁོར་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience related to saṃsāra is patience in harmony with saṃsāra that coexists with the true nature of reality, is present in order to ripen many beings, and maintains constant dedication.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་གི་སྨོན་ལམ་དང་། ཇི་ལྟར་རྐང་བཀྲ་གདུལ་བའི་ཕྱིར་སྐྱེ་བོ་མང་པོ་ལ་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་འཁོར་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence related to saṃsāra is diligence in the aspiration of the bodhisattva Avalokiteśvara dedicated to helping numerous beings, as in the case of the aspiration prayer to the glory of the bodhisattva Avalokiteśvara, as well as the appeasement of Kalmāṣapada.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་སྒྲིབ་པ་མེད་པར་སྟོན་པའི་ཏིང་ངེ་འཛིན་ལས་བྱུང་བ་ལ་སྙོམས་པར་འཇུག་པ་ན། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བདེ་བ་རབ་ཏུ་འཐོབ་པ་གང་ཡིན་པ་དེ་ནི་འཁོར་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration related to saṃsāra is the bodhisattva’s meditative attainment within the absorption that displays freedom from obscurations, thus causing numerous sentient beings to attain happiness.

source: བདག་གི་དོན་བྱང་ཆུབ་ཀྱི་སྐུ་དང་མོས་པ་སྣ་ཚོགས་པ་དག་གིས་དོན་ཀུན་ནས་ཤེས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་འཁོར་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ། འདི་དག་ནི་འཁོར་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: The perfection of insight related to saṃsāra is the perfection of insight that understands all aims in terms of the body of awakening that benefits oneself, as well as numerous inclinations. Such are the six perfections for saṃsāra.

source: དེ་ལ་ཐུན་མོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six shared perfections?

source: སྦྱིན་པའི་སྨོན་ལམ་གྱིས་ཡོངས་སུ་བསྔོས་པ་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The shared perfection of generosity is generosity developed through aspiration prayers.

source: སེམས་ཅན་ལ་རབ་ཏུ་སྦྱོར་བར་ཡོངས་སུ་བཟུང་བའི་ཉེ་བར་ལེན་པ་དང་བཅས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The shared perfection of discipline is discipline that involves appropriation that is employed to engage with sentient beings.

source: བྱིན་གྱིས་བརླབས་ཡོངས་སུ་བཟུང་བའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The shared perfection of patience is patience that employs blessings.

source: སྙིང་རྗེ་དང་མཚུངས་པར་ལྡན་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The shared perfection of diligence is diligence associated with compassion.

source: སྐྱེ་བོ་མང་པོ་ལ་ཕན་པའི་ཕྱིར་དུས་སུ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། ཡོངས་སུ་བསྔོ་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The shared perfection of concentration is concentration that is dedicated for the sake of timely ripening for the benefit of many beings.

source: བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ལ་རྨོངས་པ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The shared perfection of insight is the perfection of insight free from any delusion with respect to the links of habitual tendencies.

source: འདི་དག་ནི་ཐུན་མོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six shared perfections.

source: དེ་ལ་ཐུན་མོང་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six unshared perfections?

source: སྤོབས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་བསྒྲུབ་པ་དང་། གང་སྤོབས་པ་སྣ་ཚོགས་བསྐྱེད་པ་འགྲུབ་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་མ་ཡིན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The unshared perfection of generosity is the perfection of generosity that is practiced in order to master self-confidence and to produce various aspects of self-confidence.

source: བྱང་ཆུབ་སེམས་དཔའ་ཁྱིམ་ལ་མངོན་པར་མི་དགའ་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་མ་ཡིན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The unshared perfection of discipline is the discipline of a bodhisattva who is displeased with the householder’s life.

source: རྟོན་པ་ཐུན་མོང་མ་ཡིན་པ་ཟབ་མོའི་ཆོས་ལ་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་མ་ཡིན་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The unshared perfection of patience is the extraordinary reliance on acceptance of the profound Dharma.

source: དཔག་ཏུ་མེད་པར་འབྱུང་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་མ་ཡིན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The unshared perfection of diligence is diligence that manifests boundlessly.

source: སེམས་ཅན་ལ་བསྒོམ་པ་དང་། ཆོས་ལ་ལྷག་པའི་བསམ་པས་བསྒོམ་པ་དང་། སྟོང་པ་ཉིད་ཀྱི་རྣམ་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་མ་ཡིན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The unshared perfection of concentration is meditation concerning sentient beings, meditation by means of superior intent concerning the Dharma, and concentration on the aspects of emptiness.

source: དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པའི་རྗེས་སུ་ཞུགས་པ་དང་། ཆོས་གཉིས་རྟོགས་པ་ལས་འབྱུང་བ་དང་། ཅང་ཤེས་ཀྱི་ལས་གཉིས་ལ་རབ་ཏུ་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཐུན་མོང་མ་ཡིན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The unshared perfection of insight is comprehension that accords with correct knowledge of meaning, definitions, and the Dharma; that arises from comprehending the twofold Dharma; and that consists in the full understanding of the two deeds of nobility.

source: འདི་དག་ནི་ཐུན་མོང་མ་ཡིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six unshared perfections.

source: དེ་ལ་རྣམ་པར་བགེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of sharing?

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་བྱུང་བ་དང་། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འགྲུབ་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བགེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ།
en: The perfection of generosity based on sharing is that which arises from the perfection of generosity as well as the accomplishment of the perfection of generosity.

source: དེ་ལ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་ཅི་རིགས་པར་ལུས་ལ་ཡན་ལག་དང་ཉིང་ལག་ཡོངས་སུ་རྫོགས་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བགེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on sharing is the perfection of discipline that brings the major and minor parts of the body to perfection.

source: འཁོར་གྱི་ནང་ན་དེས་པར་གནས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བགེད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on sharing is the perfection of patience that allows one to maintain a noble demeanor within a gathering.

source: དོན་ཐམས་ཅད་གྲུབ་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བགེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on sharing is the perfection of diligence that accomplishes all aims.

source: སྔོན་གྱི་གནས་ཤེས་པ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཤེས་པ་ལ་གནས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བགེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on sharing is the perfection of concentration absorbed in understanding in order to attain perception of past lives.

source: བདེན་པ་ཡོད་པ་ལ་རབ་ཏུ་རྟོགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་བགེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on sharing is the perfection of insight that realizes what is the truth.

source: འདི་དག་ནི་རྣམ་པར་བགེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of sharing.

source: དེ་ལ་རྣམ་པར་སྨིན་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections without ripening?

source: ཇི་ལྟར་ཆུ་བོ་ནཻ་རན་ཛ་ནཱའི་འགྲམ་དུ་ཟས་རྙེད་ནས་དཀའ་བ་སྤྱད་པ་སྤྱོད་པར་ཀུན་ཏུ་སྟོན་པར་བྱིན་གྱིས་བརླབས་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་སྨིན་པ་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity without ripening is the blessing of the display of ascetic practices on the banks of the Nairañjanā although having obtained food.

source: ཇི་ལྟར་རྒྱུ་སྐར་ཉིས་སྟོང་ལྔ་བརྒྱའི་སྤྲུལ་པ་ལ་ཞུགས་ཤིང་ཆུ་བོ་གང་གཱའི་འགྲམ་ན་མི་དམིགས་པར་གནས་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་སྨིན་པ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline without ripening is to send forth emanations among the two thousand five hundred heavenly bodies while remaining free from apprehensions on the banks of the Gaṅgā.

source: ལུས་དང་། ངག་དང་། སེམས་དམིགས་པ་མེད་པས་ཕྱེ་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་སྨིན་པ་མེད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience without ripening is the perfection of patience that is distinguished in terms of nonapprehension of body, speech, and mind.

source: རྣམ་པར་བརྟགས་པ་མེད་པའི་རྩོལ་བ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་སྨིན་པ་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence without ripening is effort without prior discernment.

source: འགོག་པའི་ས་ལ་གནས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་སྨིན་པ་མེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration without ripening is the concentration of abiding within cessation.

source: ཟད་པ་མེད་པར་འགྱུར་བའི་ལྷག་མཐོང་གི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་སྨིན་པ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight without ripening is the knowledge of inexhaustible special insight.

source: འདི་དག་ནི་རྣམ་པར་སྨིན་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections without ripening.

source: དེ་ལ་ངོ་བོ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections pertaining to essence?

source: རློམ་སེམས་མེད་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་ངོ་བོ་ཉིད་ཀྱི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on essence is generosity free from conceitedness.

source: སེམས་ལ་རློམ་སེམས་མེད་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ངོ་བོ་ཉིད་ཀྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on essence is discipline free from conceited thoughts.

source: བདག་མེད་པར་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་ངོ་བོ་ཉིད་ཀྱི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on essence is acceptance of the absence of self.

source: བདག་མེད་པར་དམིགས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་ངོ་བོ་ཉིད་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on essence is diligence focused on the absence of self.

source: ཕྱི་དང་ནང་ལ་མི་གནས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་ངོ་བོ་ཉིད་ཀྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on essence is concentration that dwells neither on the external nor the internal.

source: ཆོས་ཐམས་ཅད་ལ་ཕྱིན་ཅི་ལོག་མེད་པར་བཏང་སྙོམས་པ་གང་ཡིན་པ་དེ་ནི་ངོ་བོ་ཉིད་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on essence is remaining neutral and free from error with respect to all phenomena.

source: འདི་དག་ནི་ངོ་བོ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections pertaining to essence.

source: དེ་ལ་དངོས་པོ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of nonentity?

source: མ་འོངས་པའི་སེམས་སྦྱིན་པ་ལ་མ་ཞུགས་པ་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on nonentity is generosity without the intention to give in the future.

source: ཟད་པས་རབ་ཏུ་ཕྱེ་བའི་སྡོམ་པ་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on nonentity is a commitment that discerns by elimination.

source: དགེ་བའི་འདུ་ཤེས་ཅན་དང་། མི་དགེ་བའི་འདུ་ཤེས་ཅན་དུ་སྤྲོས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on nonentity is without conceptual elaborations having notions of the virtuous or the unvirtuous.

source: ལམ་ལ་རྩོལ་བ་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on nonentity is effort on the path.

source: ཁམས་གསུམ་ལ་མངོན་པར་ཞེན་པ་མེད་པའི་སེམས་གང་དུ་ཇི་ལྟ་བ་བཞིན་རྗེས་སུ་སོང་བ་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on nonentity is a mind that is free of attachment to the three realms and adheres correctly.

source: འདི་ལ་འདུས་བྱས་ཀྱི་འདུ་ཤེས་ཅན་དང་། གང་འདུས་མ་བྱས་ཀྱི་འདུ་ཤེས་ཅན་མེད་པར་རྣམ་པར་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་དངོས་པོ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on nonentity is practiced without having notions of the conditioned or the unconditioned.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་དངོས་པོ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the bodhisattvas’ six perfections of nonentity.

source: དེ་ལ་རྒྱ་ཆེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of vastness?

source: སེམས་ཅན་དཔག་ཏུ་མེད་པའི་ཕྱིར་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྒྱ་ཆེ་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on vastness is generosity that is dedicated for the sake of limitless beings.

source: ཐམས་ཅད་དུ་འགྲོ་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་རྒྱ་ཆེ་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on vastness is discipline that is universal.

source: སྦྱོར་བ་ལ་མི་ལྟོས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་རྒྱ་ཆེ་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on vastness is patience that is not dependent on motivation.

source: དྲན་པ་ཉེ་བར་གཞག་པ་ལས་བྱུང་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་རྒྱ་ཆེ་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on vastness is diligence that emerges through the application of mindfulness.

source: ཏིང་ངེ་འཛིན་སྟོང་ཕྲག་བརྒྱད་ཅུ་སྒྲུབ་པར་བྱེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྒྱ་ཆེ་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on vastness is the perfection of concentration that accomplishes eighty thousand absorptions.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་དང་རྣམ་པར་བྱང་བ་ཁོང་དུ་ཆུད་ཅིང་སྨོན་ལམ་ཁས་འཆེས་པ་གང་ཡིན་པ་དེ་ནི་རྒྱ་ཆེ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on vastness comprehends the defilement and purification of all sentient beings and forms aspirations and promises.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྒྱ་ཆེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of vastness.

source: དེ་ལ་རྒྱས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of flourishing?

source: ཕྱིར་མི་ལྡོག་པའི་ཆོས་དང་ལྡན་པར་འགྱུར་བ་རྣམ་པ་བཅུ་དྲུག་དང་ལྡན་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྒྱས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on flourishing is generosity endowed with sixteen features that accomplish the qualities of irreversibility.

source: ཁ་ན་མ་ཐོ་བ་རྡུལ་ཙམ་ལ་འཇིགས་པར་བལྟ་བར་དམ་བཅས་པ་གང་ཡིན་པ་དེ་ནི་རྒྱས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on flourishing is committed to regarding even the most minute unvirtuous factor as something frightening.

source: རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་སྤངས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་རྒྱས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on flourishing is patience that has abandoned attachment and anger.

source: ཁ་ན་མ་ཐོ་བ་མེད་པ་ལ་རབ་ཏུ་སྦྱོར་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་རྒྱས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on flourishing is diligent engagement free from unvirtuous factors.

source: སྙིང་རྗེ་ཆེན་པོ་དང་མཚུངས་པར་ལྡན་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་རྒྱས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on flourishing is concentration associated with great compassion.

source: ཐོགས་པ་མེད་པར་སྟོན་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་རྒྱས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on flourishing is insight that teaches without impediment.

source: འདི་དག་ནི་རྒྱས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ །
en: Such are the six perfections of flourishing.

source: དེ་ལ་མཐའ་ཡས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six infinite perfections?

source: ཤེས་རབ་དང་མཚུངས་པར་ལྡན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་མཐའ་ཡས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Infinite perfection of generosity is perfection of generosity conjoined with insight.

source: ཕན་པར་འདོད་པའི་ཆོས་དང་མཚུངས་པར་ལྡན་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་མཐའ་ཡས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Infinite perfection of discipline is discipline in association with altruistic qualities.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་ལ་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་མཐའ་ཡས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Infinite perfection of patience is acceptance of the three gateways to liberation.

source: ཡང་དག་པར་ཤིན་ཏུ་སྦྱངས་པའི་གཞིའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་མཐའ་ཡས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Infinite perfection of diligence is diligence with respect to the basis of genuine pliability.

source: བྱམས་པ་ལ་སྦྱོང་ཞིང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་ལ་དམིགས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་མཐའ་ཡས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Infinite perfection of concentration is the concentration of training in loving kindness while observing the factors of awakening.

source: སོ་སོ་ཡང་དག་པར་རིག་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་མཐའ་ཡས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: Infinite perfection of insight is the insight of correct knowledge.

source: འདི་དག་ནི་མཐའ་ཡས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six infinite perfections.

source: དེ་ལ་ཚོལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of searching?

source: རབ་ཏུ་བྱུང་བ་ལྷུང་བཟེད་ཐོགས་ནས་ཅི་སྙེད་པ་ཡང་དག་པར་བགེད་པ་གང་ཡིན་པ་དེ་ནི་ཚོལ་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on searching is the renunciant’s sharing all that they receive in their alms bowl.

source: སྦྱངས་པའི་ཡོན་ཏན་གྱི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་ཚོལ་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on searching is the discipline of ascetic virtues.

source: ཐོས་པའི་གཞི་དང་། དགེ་བའི་གཞི་དག་ལས་སྡུག་བསྔལ་ལ་མི་མཇེད་པ་ནི་དཔེར་ན་རྒྱལ་པོའི་མགོ་དང་། བཙུན་མོ་ཡོངས་སུ་གཏོང་བ་ལྟ་བུ་དང་། གང་གི་ཚེ་ཡང་དག་པར་སོ་སོར་བརྟགས་པས་དང་དུ་ལེན་པ་གང་ཡིན་པ་དེ་ནི་ཚོལ་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on searching is an acceptance that is based on correct analysis. Thus, due to the bases of learning and the bases of virtue, one becomes unintimidated by suffering, as when for example a king relinquishes his own head and his queen.

source: མར་མེ་མཛད་ཀྱི་སྔོན་རོལ་དུ་སྡུག་བསྔལ་བས་དགེ་བ་ལེགས་པར་སྒྲུབ་པ་ན། ཡོངས་སུ་མི་སྐྱོ་བ་གང་ཡིན་པ་དེ་ནི་ཚོལ་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on searching is an absence of weariness when accomplishing virtue, just as in the past Dīpaṅkara did while suffering.

source: རྟོག་དཔྱོད་དང་བཅས་པའི་བསམ་གཏན་ལྷག་མཐོང་གིས་ཤས་ཆེ་བ་གང་ཡིན་པ་དེ་ནི་ཚོལ་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on searching is concentration that involves analysis and is strengthened by special insight.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་གཏན་ཚིགས་ཀྱིས་སྟོང་པ་ཉིད་ཀྱི་དོན་འཚལ་བ་གང་ཡིན་པ་དེ་ནི་ཚོལ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on searching is pursuit of the meaning of emptiness by means of logical arguments from dependent origination.

source: འདི་དག་ནི་ཚོལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of searching.

source: དེ་ལ་བརྒལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections for crossing over?

source: དབུལ་པོ་འཇོམས་པར་འགྱུར་བ་ཁྱིམ་བདག་རིན་པོ་ཆེ་སྒྲུབ་པར་བྱེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བརྒལ་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity for crossing over is the perfection of generosity that is practiced by the precious householder who eliminates poverty.

source: གང་གི་ཚེ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དག་ཀུན་ནས་བསྲུང་བ་རྣམ་པར་སྨིན་པ་སྐྱེ་བོ་གཞན་ལ་སྟོབས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་བརྒལ་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline for crossing over is the discipline with power over the ripening of other people that is observed through the path of the ten kinds of virtuous action.
